apache/nuttx/arch/arm/src/rp2040/rp2040_serial.c
/* This describes the state of the RP2040 UART1 port. */

#ifdef CONFIG_RP2040_UART1
static struct up_dev_s g_uart1priv =
{
  .uartbase  = RP2040_UART1_BASE,
  .basefreq  = BOARD_UART_BASEFREQ,
  .baud      = CONFIG_UART1_BAUD,
  .id        = 1,
  .irq       = RP2040_UART1_IRQ,
  .parity    = CONFIG_UART1_PARITY,
  .bits      = CONFIG_UART1_BITS,
  .stopbits2 = CONFIG_UART1_2STOP,
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_UART1_IFLOWCONTROL)
  .iflow     = true,
#endif
#if defined(CONFIG_SERIAL_IFLOWCONTROL) && defined(CONFIG_UART1_OFLOWCONTROL)
  .oflow     = true,
#endif
};

static uart_dev_t g_uart1port =
{
  .recv =
    {
      .size   = CONFIG_UART1_RXBUFSIZE,
      .buffer = g_uart1rxbuffer,
    },
  .xmit =
    {
      .size   = CONFIG_UART1_TXBUFSIZE,
      .buffer = g_uart1txbuffer,
    },
  .ops  = &g_uart_ops,
  .priv = &g_uart1priv,
};
#  define TTYS1_DEV g_uart1port /* UART1=ttyS1 */
#endif

/* Which UART with be tty0/console and which tty1? tty2? tty3? */

#ifdef HAVE_CONSOLE
#  if defined(CONFIG_UART0_SERIAL_CONSOLE)
#    define CONSOLE_DEV     g_uart0port /* UART0=console */
#  elif defined(CONFIG_UART1_SERIAL_CONSOLE)
#    define CONSOLE_DEV     g_uart1port /* UART1=console */
#  endif
#endif /* HAVE_CONSOLE */

/****************************************************************************
 * Inline Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_serialin
 ****************************************************************************/

static inline uint32_t up_serialin(struct up_dev_s *priv, int offset)
{
  return getreg32(priv->uartbase + offset);
}

/****************************************************************************
 * Name: up_serialout
 ****************************************************************************/

static inline void up_serialout(struct up_dev_s *priv, int offset,
                                uint32_t value)
{
  putreg32(value, priv->uartbase + offset);
}

/****************************************************************************
 * Name: up_disableuartint
 ****************************************************************************/

static inline void up_disableuartint(struct up_dev_s *priv,
                                     uint32_t *ier)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);
  if (ier)
    {
      *ier = priv->ier & RP2040_UART_INTR_ALL;
    }

  priv->ier &= ~RP2040_UART_INTR_ALL;
  up_serialout(priv, RP2040_UART_UARTIMSC_OFFSET, priv->ier);
  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: up_restoreuartint
 ****************************************************************************/

static inline void up_restoreuartint(struct up_dev_s *priv, uint32_t ier)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);
  priv->ier |= ier & RP2040_UART_INTR_ALL;
  up_serialout(priv, RP2040_UART_UARTIMSC_OFFSET, priv->ier);
  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: up_enablebreaks
 ****************************************************************************/

static inline void up_enablebreaks(struct up_dev_s *priv, bool enable)
{
  uint32_t lcr = up_serialin(priv, RP2040_UART_UARTLCR_H_OFFSET);
  if (enable)
    {
      lcr |= RP2040_UART_UARTLCR_H_BRK;
    }
  else
    {
      lcr &= ~RP2040_UART_UARTLCR_H_BRK;
    }

  up_serialout(priv, RP2040_UART_UARTLCR_H_OFFSET, lcr);
}

/****************************************************************************
 * Name: up_set_format
 *
 * Description:
 *   Set the serial line format and speed.
 *
 ****************************************************************************/

#ifndef CONFIG_SUPPRESS_UART_CONFIG
static void up_set_format(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  uint32_t lcr;
  uint32_t cr;
  uint32_t cr_en;
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);

  /* Get the original state of control register */

  cr    = up_serialin(priv, RP2040_UART_UARTCR_OFFSET);
  cr_en = cr & RP2040_UART_UARTCR_UARTEN;
  cr   &= ~RP2040_UART_UARTCR_UARTEN;

  /* Disable until the format bits and baud rate registers are updated */

  up_serialout(priv, RP2040_UART_UARTCR_OFFSET, cr);

  /* Set the BAUD divisor */

  rp2040_setbaud(priv->uartbase, priv->basefreq, priv->baud);

  /* Set up the LCR */

  lcr = up_serialin(priv, RP2040_UART_UARTLCR_H_OFFSET);

  lcr &= ~(RP2040_UART_LCR_H_WLEN(8) | RP2040_UART_UARTLCR_H_STP2 |
           RP2040_UART_UARTLCR_H_EPS | RP2040_UART_UARTLCR_H_PEN);

  if ((5 <= priv->bits) && (priv->bits < 8))
    {
      lcr |= RP2040_UART_LCR_H_WLEN(priv->bits);
    }
  else
    {
      lcr |= RP2040_UART_LCR_H_WLEN(8);
    }

  if (priv->stopbits2)
    {
      lcr |= RP2040_UART_UARTLCR_H_STP2;
    }

  if (priv->parity == 1)
    {
      lcr |= (RP2040_UART_UARTLCR_H_PEN);
    }
  else if (priv->parity == 2)
    {
      lcr |= (RP2040_UART_UARTLCR_H_PEN | RP2040_UART_UARTLCR_H_EPS);
    }

  up_serialout(priv, RP2040_UART_UARTLCR_H_OFFSET, lcr);

  /* Enable Auto-RTS and Auto-CS Flow Control in the Modem Control Register */

  cr &= ~(RP2040_UART_UARTCR_RTSEN | RP2040_UART_UARTCR_CTSEN);
  cr |= RP2040_UART_UARTCR_RTS;

#ifdef CONFIG_SERIAL_IFLOWCONTROL
  if (priv->iflow)
    {
      cr |= RP2040_UART_UARTCR_RTSEN;
    }
#endif
#ifdef CONFIG_SERIAL_OFLOWCONTROL
  if (priv->oflow)
    {
      cr |= RP2040_UART_UARTCR_CTSEN;
    }
#endif
  up_serialout(priv, RP2040_UART_UARTCR_OFFSET, cr | cr_en);

  spin_unlock_irqrestore(&priv->lock, flags);
}
#endif /* CONFIG_SUPPRESS_UART_CONFIG */

/****************************************************************************
 * Name: up_setup
 *
 * Description:
 *   Configure the UART baud, bits, parity, fifos, etc. This method is
 *   called the first time that the serial port is opened.
 *
 ****************************************************************************/

